Autodesk.Revit.DB.AssemblyDifference.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.AssemblyDifference
Class that describes difference between two assemblies.
Remarks:
The assembly comparison function returns a sub-class of this class.
Different sub-classes represent different kinds of differences and contain
additional data for each particular kind of difference.
Since:
2012